# -*- mode: Org; org-download-image-dir: "../images"; -*-
#+TITLE: 什么是 e
#+DATE: 2017-02-11 15:52:25 
#+TAGS: mathjax, 数学
#+CATEGORY: 
#+LINK: 
#+DESCRIPTION: 
#+LAYOUT : post

什么是e？简单说，e就是 *增长的极限* 

----------------------------------------------

假定有一种单细胞生物，它每过24小时分裂一次。

那么很显然，这种生物的数量，每天都会翻一倍。今天是1个，明天就是2个，后天就是4个。我们可以写出一个增长数量的公式：

$$ growth = 2^x $$

这个式子可以被改成下面这样：

$$ growth = ((1+\frac{100\%}{T})^T ) ^x $$

其中，1表示原有数量，100%/T表示单位时间内的增长率。此处 T = 1
----------------------------------------------

我们继续假定：每过12个小时，也就是分裂进行到一半的时候，新产生的那半个细胞已经可以再次分裂了。

因此，一天24个小时可以分成两个阶段，每一个阶段都在前一个阶段的基础上增长50%。

$$ growth = ((1+\frac{100\%}{2})^2 ) ^x =2.25 ^x $$

当这一天结束的时候，我们一共得到了2.25个细胞。其中，1个是原有的，1个是新生的，另外的0.25个是新生细胞分裂到一半的。

如果我们继续修改假设，这种细胞每过8小时就具备独立分裂的能力，也就是将1天分成3个阶段。

$$ growth = ((1+\frac{100\%}{3})^3 ) ^x =2.37 ^x $$

#+BEGIN_SRC python :results output :exports both
print((1+1/3)**3)
#+END_SRC

#+RESULTS:
: 2.37037037037037

那么，最后我们就可以得到大约2.37个细胞。

很自然地，如果我们进一步设想，这种分裂是连续不断进行的，新生细胞每分每秒都具备继续分裂的能力，那么一天最多可以得到多少个细胞呢？


当n趋向无限时，这个式子的极值等于2.718281828...。


因此，当增长率为100%保持不变时，我们在单位时间内最多只能得到2.71828个细胞。数学家把这个数就称为e，它的含义是单位时间内，持续的翻倍增长所能达到的极限值。

这个值是自然增长的极限，因此以e为底的对数，就叫做自然对数。

----------------------------------------------

有了这个值以后，计算银行的复利就非常容易。

假定有一家银行，每年的复利是100%，请问存入100元，一年后可以拿多少钱？

回答就是271.828元，等于100个e。

但是，实际生活中，银行的利息没有这么高，如果利息率只有5%，那么100元存一年可以拿到多少钱呢？


为了便于思考，我们取n等于50：


我们知道，在100%利息率的情况下，n=1000所得到的值非常接近e：


因此，5%利息率就相当于e的20分之一次方：


20分之一正好等于5%的利率率，所以我们可以把公式改写成：

$$growth = e^{rate}$$ 

上式的rate就代表增长率。这说明e可以用于任何增长率的计算，前提是它必须是持续不断的复合式增长。

-------------------------------

再考虑时间因素，如果把钱在银行里存2年，可以得到多少钱？


在时间t的情况下，通用公式就是：


上式就是计算增长量的万能公式，可以适用于任何时间、任何增长率。


回到上面的例子，如果银行的利息率是5%的复利，请问100元存款翻倍需要多少时间？

$$ 100 \cdot e ^{5\%t} = 200$$

#+BEGIN_SRC python :results output :exports both
  from math import log
  print(log(2)/0.05)
#+END_SRC

#+RESULTS:
: 13.862943611198904


计算结果是 13.86 年：

$$t = \frac{ln2}{5\%} =  \frac{0.693}{5\%} = \frac{69.3}{5} \simeq \frac{72}{5}$$

上式最后一个等号，表明用72除以增长率，可以得到翻倍的大致时间，这就是72法则的来源。
